; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	spectrograph8 - mode
	thermograph1 - mode
	image3 - mode
	infrared4 - mode
	infrared6 - mode
	thermograph0 - mode
	spectrograph5 - mode
	spectrograph7 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph8)
	(supports instrument0 infrared6)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument3 image3)
	(supports instrument3 spectrograph8)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared6)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared4)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
)
(:goal (and
	(pointing satellite2 Planet9)
	(have_image Planet6 thermograph0)
	(have_image Planet6 spectrograph8)
	(have_image Planet6 infrared6)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon7 infrared6)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon8 infrared6)
	(have_image Planet9 spectrograph8)
	(have_image Planet9 spectrograph7)
	(have_image Star10 infrared6)
	(have_image Star10 spectrograph5)
	(have_image Phenomenon11 infrared6)
))

)

; plan
1. (turn_to satellite2 groundstation0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 14
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 14
3. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 14
4. (turn_to satellite2 star10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star10)
   goals met: 0 of 14
5. (take_image satellite2 star10 instrument4 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 1 of 14
6. (take_image satellite2 star10 instrument4 infrared6)
   added: (have_image star10 infrared6)
   goals met: 2 of 14
7. (turn_to satellite2 phenomenon8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 14
8. (take_image satellite2 phenomenon8 instrument4 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 3 of 14
9. (take_image satellite2 phenomenon8 instrument4 infrared6)
   added: (have_image phenomenon8 infrared6)
   goals met: 4 of 14
10. (turn_to satellite2 groundstation1 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation1)
   goals met: 4 of 14
11. (turn_to satellite1 groundstation2 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 14
12. (turn_to satellite0 star4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star4)
   goals met: 4 of 14
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 14
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 14
15. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 4 of 14
16. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 4 of 14
17. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 14
18. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 14
19. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 4 of 14
20. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 14
21. (take_image satellite0 phenomenon11 instrument0 infrared6)
   added: (have_image phenomenon11 infrared6)
   goals met: 5 of 14
22. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 14
23. (take_image satellite0 phenomenon7 instrument0 infrared6)
   added: (have_image phenomenon7 infrared6)
   goals met: 6 of 14
24. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 6 of 14
25. (take_image satellite0 planet6 instrument0 infrared6)
   added: (have_image planet6 infrared6)
   goals met: 7 of 14
26. (take_image satellite0 planet6 instrument0 spectrograph8)
   added: (have_image planet6 spectrograph8)
   goals met: 8 of 14
27. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 8 of 14
28. (take_image satellite0 planet9 instrument0 spectrograph7)
   added: (have_image planet9 spectrograph7)
   goals met: 9 of 14
29. (take_image satellite0 planet9 instrument0 spectrograph8)
   added: (have_image planet9 spectrograph8)
   goals met: 10 of 14
30. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 10 of 14
31. (take_image satellite1 phenomenon7 instrument2 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 11 of 14
32. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 11 of 14
33. (take_image satellite1 planet6 instrument2 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 12 of 14
34. (turn_to satellite2 phenomenon7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon7)
   goals met: 12 of 14
35. (take_image satellite2 phenomenon7 instrument5 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 13 of 14
36. (turn_to satellite2 planet9 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet9)
   goals met: 14 of 14
